## Lab 1: Data in Python

The data for this activity can be downloaded here (under "Data Sets"): https://www.statlearning.com/resources-python

As a first step, create a folder in this location called "data" and drop the Credit.csv file in that location.

If you open the ".gitignore" file, you'll notice that one of the entries is "data" so that your data files will not be shared on GitHub.

In [106]:
import pandas as pd
import numpy as np
Credit = pd.read_csv('data/Credit.csv')
Credit

,Income,Limit,Rating,Cards,Age,Education,Own,Student,Married,Region,Balance
0,14.891,3606,283,2,34,11,No,No,Yes,South,333
1,106.025,6645,483,3,82,15,Yes,Yes,Yes,West,903
2,104.593,7075,514,4,71,11,No,No,No,West,580
3,148.924,9504,681,3,36,11,Yes,No,No,West,964
4,55.882,4897,357,2,68,16,No,No,Yes,South,331
...,...,...,...,...,...,...,...,...,...,...,...
395,12.096,4100,307,3,32,13,No,No,Yes,South,560
396,13.364,3838,296,5,65,17,No,No,No,East,480
397,57.872,4171,321,5,67,12,Yes,No,Yes,South,138
398,37.728,2525,192,1,44,13,No,No,Yes,South,0
399,18.701,5524,415,5,64,7,Yes,No,No,West,966

### What are the feature names?

In [107]:
Credit.columns

Index(['Income', 'Limit', 'Rating', 'Cards', 'Age', 'Education', 'Own',
       'Student', 'Married', 'Region', 'Balance'],
      dtype='object')

### What are the data types of the feature values (i.e., numeric, categorical)

In [108]:
for a in Credit:
    print(Credit[a].dtype)

float64
int64
int64
int64
int64
int64
object
object
object
object
int64

### Find the mean, median, and mode of the feature "Age."

In [109]:
# mean
sum = 0
for a in Credit.Age:
    sum += a

print(sum / len(Credit.Age))

55.6675

In [110]:
# median
Ages = Credit.Age
Ages = Ages.sort_values()
if len(Ages) % 2 == 0:
    print((Ages[len(Ages) / 2] + Ages[len(Ages) / 2 - 1]) / 2)
else:
    print(Ages[len(Ages) / 2 - 0.5])

41.5

In [111]:
# mode
mode = [[-1000],-1000]
cur = [-1000,0]

for a in Ages:
    if a != cur[0]:
        if cur[1] > mode[1]:
            mode[0] = [cur[0]]
            mode[1] = cur[1]
        elif cur[1] == mode[1]:
            mode[0].append(cur[0])
        cur[0] = a
        cur[1] = 1
    else:
        cur[1] += 1

if cur[1] > mode[1]:
    mode[0] = cur[0]
    mode[1] = cur[1]
elif cur[1] == mode :
    mode[0].append(cur[0])

print(mode[0])

[44, 66]

### Create a subset of Credit that only contains the columns Age, Region, and Income. Call it "Subset."

In [112]:
Subset = Credit[['Age', 'Region', 'Income']]
Subset

     Age Region   Income
0     34  South   14.891
1     82   West  106.025
2     71   West  104.593
3     36   West  148.924
4     68  South   55.882
..   ...    ...      ...
395   32  South   12.096
396   65   East   13.364
397   67  South   57.872
398   44  South   37.728
399   64   West   18.701

[400 rows x 3 columns]

### From this subset, create two partitions: 
- One that contains records for Ages below 50, and one that contains Ages 50+
- Call them "Younger" and "Older"

In [113]:
Younger = Subset[Subset['Age'] < 50]
Younger

     Age Region   Income
0     34  South   14.891
3     36   West  148.924
6     37   East   20.996
9     41   East   71.061
10    30  South   63.095
..   ...    ...      ...
391   43  South   73.327
392   24   West   25.974
394   40  South   49.794
395   32  South   12.096
398   44  South   37.728

[161 rows x 3 columns]

In [114]:
Older = Subset[Subset['Age'] >= 50]
Older

     Age Region   Income
1     82   West  106.025
2     71   West  104.593
4     68  South   55.882
5     77  South   80.180
7     87   West   71.408
..   ...    ...      ...
390   81   West  135.118
393   65   East   17.316
396   65   East   13.364
397   67  South   57.872
399   64   West   18.701

[239 rows x 3 columns]

### Use these partitions to compare the mean and median Income for each age group (less than 50 vs. 50+)

In [115]:
# mean of younger
sum = 0
for a in Younger.Age:
    sum += a

print(sum / len(Younger.Age))

38.06211180124224

In [116]:
# mean of older
sum = 0
for a in Older.Age:
    sum += a

print(sum / len(Older.Age))

67.52719665271967

In [117]:
# median of younger
yAges = Younger.Age
yAges = yAges.sort_values()
if len(yAges) % 2 == 0:
    print((yAges[len(yAges) / 2] + yAges[len(yAges) / 2 - 1]) / 2)
else:
    print(yAges[len(yAges) / 2 - 0.5])

40

In [118]:
# median of older
oAges = Older.Age
oAges = oAges.sort_values()
if len(oAges) % 2 == 0:
    print((oAges[len(oAges) / 2] + oAges[len(oAges) / 2 - 1]) / 2)
else:
    print(oAges[len(oAges) / 2 - 0.5])

81

### What does the difference between mean and median suggest about the distribution of income?

The difference between the mean and median in the younger ages is small. This suggests that the data is not skewed, and centered around 39.

The difference between the mean and median in the older ages is large, with the mean being smaller than the median. This suggests that the distribution of income is skewed to the right.

### What are the possible values for Region?

In [119]:
for a in Credit['Region'].unique():
    print(a)

South
West
East

### Use the value_counts method to build a frequency table for the possible values of Region.

In [120]:
print(Credit['Region'].value_counts())
print(Credit['Region'].value_counts(normalize=True))

Region
South    199
West     102
East      99
Name: count, dtype: int64
Region
South    0.4975
West     0.2550
East     0.2475
Name: proportion, dtype: float64

### Compare the average income for students vs. non-students.

In [121]:
Students = Credit[Credit['Student'] == 'Yes']
Students.head()

,Income,Limit,Rating,Cards,Age,Education,Own,Student,Married,Region,Balance
1,106.025,6645,483,3,82,15,Yes,Yes,Yes,West,903
9,71.061,6819,491,3,41,19,Yes,Yes,Yes,East,1350
26,42.471,3625,289,6,44,12,Yes,Yes,No,South,654
35,23.350,2558,220,3,49,12,Yes,Yes,No,South,419
41,113.659,7659,538,2,66,15,No,Yes,Yes,East,1155

In [122]:
nonStudents = Credit[Credit['Student'] == 'No']
nonStudents.head()

,Income,Limit,Rating,Cards,Age,Education,Own,Student,Married,Region,Balance
0,14.891,3606,283,2,34,11,No,No,Yes,South,333
2,104.593,7075,514,4,71,11,No,No,No,West,580
3,148.924,9504,681,3,36,11,Yes,No,No,West,964
4,55.882,4897,357,2,68,16,No,No,Yes,South,331
5,80.180,8047,569,4,77,10,No,No,No,South,1151

In [123]:
sum = 0
for a in Students.Age:
    sum += a

print(sum / len(Students.Age))

54.125

In [124]:
sum = 0
for a in nonStudents.Age:
    sum += a

print(sum / len(nonStudents.Age))

55.83888888888889

Often, banks will use a variable called _utilization_ to assess credit risk.
Utilization is the ratio of balance to limit (i.e., what % of the credit limit is being used?)
### Add a feature to the Credit dataset to measure utilization

In [125]:
Credit['Utilization'] = Credit['Balance'] / Credit['Limit']
Credit['Utilization']

0      0.092346
1      0.135892
2      0.081979
3      0.101431
4      0.067592
         ...
395    0.136585
396    0.125065
397    0.033086
398    0.000000
399    0.174873
Name: Utilization, Length: 400, dtype: float64

### What is the maximum utilization value in this set?

In [126]:
max = -10
for a in Credit.Utilization:
    if a > max:
        max = a

print(max)

0.27693008426326576